# Space_AddAreaModif

## Description
Add Area Modifier to a space object.

```pascal
FUNCTION Space_AddAreaModif(
				space    : HANDLE;
				modifier : HANDLE) : BOOLEAN;
```

```python

def vs.Space_AddAreaModif(space, modifier):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||
|modifier|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools